Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.TextTypeId
Element id of text associated with the settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings)
Constructs a new copy of the input AnalysisDisplayMarkersAndTextSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011